---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BalusterInfo.BalusterFamilyId
source: html/ca4c5f7c-da65-9a71-51ab-3ba05f6b15ba.htm
---
# Autodesk.Revit.DB.Architecture.BalusterInfo.BalusterFamilyId Property

The id of the family used for the baluster or post.

## Syntax (C#)
```csharp
public ElementId BalusterFamilyId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The balusterFamilyId doesn't refer to a valid baluster family.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null